{"format": "graph-model", "generatedBy": "2.13.0", "convertedBy": "TensorFlow.js Converter v4.20.0", "signature": {"inputs": {"restaurant_id:0": {"name": "restaurant_id:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}]}}, "user_id:0": {"name": "user_id:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}]}}, "user_rating": {"name": "user_rating:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "32"}]}}, "Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "32"}]}}, "output_3": {"name": "Identity_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/yelp_rec_model_13/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/yelp_rec_model_13/sequential_41/dense_77/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yelp_rec_model_13/sequential_41/dense_78/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/yelp_rec_model_13/sequential_41/dense_79/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yelp_rec_model_13/sequential_41/dense_80/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/yelp_rec_model_13/sequential_41/dense_81/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yelp_rec_model_13/embedding_30/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yelp_rec_model_13/embedding_31/embedding_lookup/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "restaurant_id", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "user_id", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "user_rating", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yelp_rec_model_13/embedding_31/embedding_lookup", "op": "GatherV2", "input": ["unknown_0", "restaurant_id", "StatefulPartitionedCall/yelp_rec_model_13/embedding_31/embedding_lookup/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/yelp_rec_model_13/embedding_30/embedding_lookup", "op": "GatherV2", "input": ["unknown", "user_id", "StatefulPartitionedCall/yelp_rec_model_13/embedding_30/embedding_lookup/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "batch_dims": {"i": "0"}, "_has_manual_control_dependencies": {"b": true}, "Tindices": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yelp_rec_model_13/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/yelp_rec_model_13/embedding_30/embedding_lookup", "StatefulPartitionedCall/yelp_rec_model_13/embedding_31/embedding_lookup", "StatefulPartitionedCall/yelp_rec_model_13/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/output_control_node/_18", "op": "NoOp", "input": ["^StatefulPartitionedCall/yelp_rec_model_13/embedding_30/embedding_lookup", "^StatefulPartitionedCall/yelp_rec_model_13/embedding_31/embedding_lookup"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall/yelp_rec_model_13/embedding_30/embedding_lookup", "^StatefulPartitionedCall/yelp_rec_model_13/embedding_31/embedding_lookup"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/yelp_rec_model_13/sequential_41/dense_77/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/yelp_rec_model_13/concat", "StatefulPartitionedCall/yelp_rec_model_13/sequential_41/dense_77/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/yelp_rec_model_13/embedding_30/embedding_lookup", "^Func/StatefulPartitionedCall/output_control_node/_18", "^StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/yelp_rec_model_13/embedding_31/embedding_lookup", "^Func/StatefulPartitionedCall/output_control_node/_18", "^StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yelp_rec_model_13/sequential_41/dense_77/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/yelp_rec_model_13/sequential_41/dense_77/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yelp_rec_model_13/sequential_41/dense_78/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/yelp_rec_model_13/sequential_41/dense_77/Relu", "StatefulPartitionedCall/yelp_rec_model_13/sequential_41/dense_78/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yelp_rec_model_13/sequential_41/dense_78/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/yelp_rec_model_13/sequential_41/dense_78/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yelp_rec_model_13/sequential_41/dense_79/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/yelp_rec_model_13/sequential_41/dense_78/Relu", "StatefulPartitionedCall/yelp_rec_model_13/sequential_41/dense_79/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yelp_rec_model_13/sequential_41/dense_79/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/yelp_rec_model_13/sequential_41/dense_79/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yelp_rec_model_13/sequential_41/dense_80/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/yelp_rec_model_13/sequential_41/dense_79/Relu", "StatefulPartitionedCall/yelp_rec_model_13/sequential_41/dense_80/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/yelp_rec_model_13/sequential_41/dense_80/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/yelp_rec_model_13/sequential_41/dense_80/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yelp_rec_model_13/sequential_41/dense_81/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/yelp_rec_model_13/sequential_41/dense_80/Relu", "StatefulPartitionedCall/yelp_rec_model_13/sequential_41/dense_81/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "Identity_2", "op": "Identity", "input": ["StatefulPartitionedCall/yelp_rec_model_13/sequential_41/dense_81/MatMul", "^Func/StatefulPartitionedCall/output_control_node/_18", "^StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1645}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/yelp_rec_model_13/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/yelp_rec_model_13/sequential_41/dense_77/MatMul/ReadVariableOp", "shape": [64, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/yelp_rec_model_13/sequential_41/dense_78/MatMul/ReadVariableOp", "shape": [256, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/yelp_rec_model_13/sequential_41/dense_79/MatMul/ReadVariableOp", "shape": [128, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/yelp_rec_model_13/sequential_41/dense_80/MatMul/ReadVariableOp", "shape": [64, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/yelp_rec_model_13/sequential_41/dense_81/MatMul/ReadVariableOp", "shape": [32, 1], "dtype": "float32"}, {"name": "unknown", "shape": [3, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/yelp_rec_model_13/embedding_30/embedding_lookup/axis", "shape": [], "dtype": "int32"}, {"name": "unknown_0", "shape": [3, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/yelp_rec_model_13/embedding_31/embedding_lookup/axis", "shape": [], "dtype": "int32"}]}]}